sum(1,2,3,4,5)#求和
1:5+6:10#冒号表示从某个数值开始到另一个数值结束的序列。
c(1,3,6,10,15)+c(0,1,3,6,10)#c表示吧一系列的值拼接起来创建向量
median(1,2,3,4,5)#计算中位数
mean(1,2,3,4,5)#计算算数平均值
mean(2,2,3,4,5)#计算算数平均值

c(2,3,5,7,11,13)-2#向量的减法
-2:2*-2:2#向量的乘法
1:10 / 3#向量的除法
abs(-9)#去绝对值
abs(10)#去绝对值
sqrt(8)#计算平方根

log(10)#求以e为底的对数
log10(10)#求以10为底的对数
log10(100)#求以10为底的对数
1.23e5#e5表示乘以10的5次方
identical(2^3,2**3)#判断是否相等

pi#表示3.141593
sin(30)#计算正弦函数
sin(2)#计算正弦函数
sin(pi/3)#计算正弦函数
cos(c(0,pi/4,pi/2,pi))#计算余弦函数

round(3.1456444,4)#取小数点后四位
floor(3.1455443)#向下取整
trunc(3.456678)#去除小数部分
factorial(3)#计算3的阶乘
ceiling(3.467668)#向上取整

exp(pi * 1i) + 1#计算自然对数e的次方
factorial(7) + factorial(1) - 71^3#
choose(5, 0:5)#从5个元素中抽出i个元素

c(3,4-1,1+2,1+1+1) == 3#比较整数值是否相等
exp(1:5)<100#比较大小
(1:5) ^ 2 >= 16#比较大小
sqrt(2)^2 == 2#比较整数值是否相等
sqrt(2) ^ 2 - 2#计算
all.equal(sqrt(2) ^ 2 , 2)#比较值是否相等（可以设置容忍的误差值）
all.equal(sqrt(2) ^ 2 , 3)#比较值是否相等（可以设置容忍的误差值）
isTRUE(all.equal(sqrt(2) ^ 2 , 3))#判断真假

c("a","b","C","d")<"C"#比较字符串

x <- 5:10#对x的赋值
y <- 3:7#对y的赋值
x+2*y-3#向量的计算

c(Inf+1,Inf-1)#关于无穷的计算
c(Inf+1,Inf-1,Inf+Inf)#关于无穷的计算
c(Inf-Inf)#关于无穷的计算
c(1/Inf,Inf/1,Inf/Inf)#关于无穷的计算
c(sqrt(Inf),sin(Inf))#关于无穷的计算
c(log(Inf),log(Inf,Inf))#关于无穷的计算
c(NA+1,NA*5,NA+Inf)#关于缺失值的计算
c(NA+NA,NaN+NaN,NaN+NA,NA+NaN)#关于缺失值的计算

x3 <- c(0,Inf-Inf,NaN,NA)#对x3的赋值
is.finite(x3)#判断是否为无穷大值
is.infinite(x3)#判断是否不为无穷大值
is.nan(x3)#判断是否为非数值

 x4 <- 1:10 >=5#对x4的赋值；比较大小
!x4#！表示非操作
y4 <- 1:10 %% 2 == 0#对y4的赋值；计算除法后的余数；判断是否相等
x4|y4#|表示或操作
x4&y4#&表示与操作

